const QnA = [
    {
        questionNum: "Q1",
        question: "어떤 종류의 앱을 만들고 싶으신가요?",
        answer1: "일상적인 일정을 관리하는 앱을 만들고 싶어요.",
        answer2: "수학적인 계산이나 문제 해결을 위한 앱을 만들고 싶어요."
    },
    {
        questionNum: "Q2",
        question: "어떤 기술을 배우고 싶은가요?",
        answer1: "로컬 데이터의 CRUD 작업과 저장 방식을 익히고 싶어요.",
        answer2: "외부 API를 활용하여 데이터 요청과 처리 방법을 배우고 싶어요."
    },
    {
        questionNum: "Q3",
        question: "어떤 기능을 앱에 포함시키고 싶으세요?",
        answer1: "외부 데이터를 받아와서 시각적으로 표현하는 기능을 포함시키고 싶어요.",
        answer2: "사용자 입력을 받아들이고 처리하여 동적으로 반응하는 기능을 포함시키고 싶어요."
    },
    {
        questionNum: "Q4",
        question: "어떤 종류의 프로젝트를 선호하시나요?",
        answer1: "이미지와 인터페이스 관리에 초점을 맞춘 프로젝트가 좋아요.",
        answer2: "데이터 구조와 관리 방법을 배우고 싶은 프로젝트가 좋아요."
    },
    {
        questionNum: "Q5",
        question: "어떤 종류의 정보를 다루는 앱을 만들고 싶으세요?",
        answer1: "현실적이고 유용한 일정 관리나 작업 목록을 다루는 앱을 만들고 싶어요.",
        answer2: "정보를 탐색하고 검색하는 기능을 가진 앱을 만들고 싶어요."
    },
    {
        questionNum: "Q6",
        question: "어떤 종류의 UI/UX를 경험해보고 싶으세요?",
        answer1: "데이터의 상태 관리와 관련된 UI/UX를 경험해보고 싶어요.",
        answer2: "외부 데이터의 처리와 표현을 중심으로 한 UI/UX를 경험해보고 싶어요."
    },
    {
        questionNum: "Q7",
        question: "어떤 종류의 프로젝트를 완성하고 싶으세요?",
        answer1: "사용자의 일상에서 유용하게 활용할 수 있는 앱을 만들고 싶어요.",
        answer2: "외부 데이터를 효과적으로 활용하여 유용한 서비스를 제공하는 앱을 만들고 싶어요."
    },
    {
        questionNum: "Q8",
        question: "어떤 종류의 기술적 도전에 도전하고 싶으세요?",
        answer1: "데이터 처리와 관리에 대한 기술적 도전을 경험해보고 싶어요.",
        answer2: "외부 데이터와의 상호작용 및 반응형 기능 구현에 대한 기술적 도전을 경험해보고 싶어요."
    },
    {
        questionNum: "Q9",
        question: "어떤 종류의 기술적 성장을 이루고 싶으세요?",
        answer1: "로컬 데이터와 상태 관리에 대한 기술적 이해와 능력을 키우고 싶어요.",
        answer2: "외부 데이터와의 상호작용과 API 요청 및 처리 능력을 키우고 싶어요."
    },
    {
        questionNum: "Q10",
        question: "어떤 종류의 창의성을 발휘하고 싶으세요?",
        answer1: "사용자와의 상호작용을 통한 창의적인 UI/UX 디자인에 도전하고 싶어요.",
        answer2: "외부 데이터의 시각적 표현 및 사용자 경험을 개선하는 창의적인 아이디어를 실현하고 싶어요."
    }
];

export default QnA;
